Switch>en
Switch#
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#hos
Switch(config)#hostname A
%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/1 (1), with DSW1 FastEthernet0/1 (99).
SW1
ASW1(config)#
ASW1(config)#
ASW1(config)#
ASW1(config)#
%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/2 (1), with DSW2 FastEthernet0/1 (99).

ASW1(config)#
ASW1(config)#
ASW1(config)#vlan 10
ASW1(config-vlan)#vlan 20
ASW1(config-vlan)#vlan 99
ASW1(config-vlan)#
ASW1(config-vlan)#
ASW1(config-vlan)#
ASW1(config-vlan)#exit
ASW1(config)#
ASW1(config)#
ASW1(config)#
ASW1(config)#inter
ASW1(config)#interface ran
ASW1(config)#interface range fas
ASW1(config)#interface range fastEthernet 0/1 - 2
ASW1(config-if-range)#
ASW1(config-if-range)#
ASW1(config-if-range)#swi
ASW1(config-if-range)#switchport mo
ASW1(config-if-range)#switchport mode tru
ASW1(config-if-range)#switchport mode trunk 
ASW1(config-if-range)#
ASW1(config-if-range)#
ASW1(config-if-range)#swi
ASW1(config-if-range)#switchport tru
ASW1(config-if-range)#switchport trunk na
ASW1(config-if-range)#switchport trunk native vla
ASW1(config-if-range)#switchport trunk native vlan 99
ASW1(config-if-range)#
ASW1(config-if-range)#
ASW1(config-if-range)#s%SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet0/2 on VLAN0099. Port consistency restored.

%SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet0/2 on VLAN0001. Port consistency restored.

wi
ASW1(config-if-range)#switchport tru
ASW1(config-if-range)#switchport trunk all
ASW1(config-if-range)#switchport trunk allowed vla
ASW1(config-if-range)#switchport trunk allowed vlan 10,20,99
ASW1(config-if-range)#
ASW1(config-if-range)#
ASW1(config-if-range)#
ASW1(config-if-range)#
ASW1(config-if-range)#exit
ASW1(config)#
ASW1(config)#
ASW1(config)#inter
ASW1(config)#interface fas
ASW1(config)#interface fastEthernet 0/4
ASW1(config-if)#
ASW1(config-if)#
ASW1(config-if)#swi
ASW1(config-if)#switchport mo
ASW1(config-if)#switchport mode acc
ASW1(config-if)#switchport mode access 
ASW1(config-if)#
ASW1(config-if)#swi
ASW1(config-if)#switchport acc
ASW1(config-if)#switchport access vla
ASW1(config-if)#switchport access vlan 10
ASW1(config)#interface fastEthernet 0/5
ASW1(config-if)#
ASW1(config-if)#
ASW1(config-if)#swi
ASW1(config-if)#switchport mo
ASW1(config-if)#switchport mode acc
ASW1(config-if)#switchport mode access 
ASW1(config-if)#
ASW1(config-if)#swi
ASW1(config-if)#switchport acc
ASW1(config-if)#switchport access vla
ASW1(config-if)#switchport access vlan 30
% Access VLAN does not exist. Creating vlan 30
ASW1(config-if)#
ASW1(config-if)#switchport access vlan 20